Revit 2027 API
WorksetPreview.Id Property
 Id of the workset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksetId Id { get; }
Public ReadOnly Property Id As WorksetId
	Get
public:
property WorksetId^ Id {
	WorksetId^ get ();
}
member Id : WorksetId with get
Property Value
WorksetId
Remarks
 Id of the workset may be changed while synchronizing with central. Please use UniqueId to reliably identify worksets despite changes which occur due to synchronization with central.
See Also
Reference
WorksetPreview Class
Autodesk.Revit.DB Namespace